--+ holdcas on;
===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
0
===================================================
date_add(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:12:01.0     
1995-01-01 00:13:02.0     

===================================================
0
===================================================
date_add(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:12:01.0     
1995-01-01 00:13:02.0     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
0
===================================================
date_add(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:12:01.123     
1995-01-01 00:13:02.123     

===================================================
0
===================================================
date_add(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:12:01.123     
1995-01-01 00:13:02.123     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
0
===================================================
date_sub(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:08:01.000 Asia/Seoul KST     
1995-01-01 00:07:02.000 Asia/Seoul KST     

===================================================
0
===================================================
date_sub(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:08:01.000 Asia/Seoul KST     
1995-01-01 00:07:02.000 Asia/Seoul KST     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
0
===================================================
date_sub(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:08:01.000 Asia/Seoul KST     
1995-01-01 00:07:02.000 Asia/Seoul KST     

===================================================
0
===================================================
date_sub(col1, INTERVAL @a := @a+1 MINUTE)    
1995-01-01 00:08:01.000 Asia/Seoul KST     
1995-01-01 00:07:02.000 Asia/Seoul KST     

===================================================
0
===================================================
0

--+ holdcas off;
