===================================================
0
===================================================
json_pretty(@jv)    
{
  "a": 1,
  "b": 2,
  "c": 3
}     

===================================================
json_pretty('{"a": 1, "b": 2, "c": 3}')    
{
  "a": 1,
  "b": 2,
  "c": 3
}     

===================================================
0
===================================================
json_pretty(@jv)    
[
  1,
  2,
  3
]     

===================================================
json_pretty('[1, 2, 3]')    
[
  1,
  2,
  3
]     

===================================================
0
===================================================
json_pretty(@jv)    
[
  1,
  2,
  [
    3,
    4,
    5
  ]
]     

===================================================
json_pretty('[1, 2, [3, 4, 5]]')    
[
  1,
  2,
  [
    3,
    4,
    5
  ]
]     

===================================================
0
===================================================
json_pretty(@jv)    
[
  1,
  2,
  [],
  {}
]     

===================================================
json_pretty('[1, 2, [], {}]')    
[
  1,
  2,
  [],
  {}
]     

===================================================
0
===================================================
json_pretty(@jv)    
[
  1,
  2,
  3
]     

===================================================
a    
[
  1,
  2,
  3
]     

===================================================
0
===================================================
json_pretty(@jv)    
{
  "Person": {
    "Name": "Bart",
    "Age": 10,
    "Friends": [
      "Bart",
      "Milhouse"
    ]
  }
}     

===================================================
0
===================================================
json_pretty(@jv)    
123     

===================================================
json_pretty('123')    
123     

===================================================
0
===================================================
json_pretty(@jv)    
[
  1,
  3,
  5
]     

===================================================
json_pretty('[1,3,5]')    
[
  1,
  3,
  5
]     

===================================================
0
===================================================
json_pretty(@jv)    
{
  "a": "10",
  "x": "25",
  "b": "15"
}     

===================================================
json_pretty('{"a":"10","x":"25","b":"15"}')    
{
  "a": "10",
  "x": "25",
  "b": "15"
}     

===================================================
0
===================================================
json_pretty(@jv)    
[
  "a",
  1,
  {
    "key1": "value1"
  },
  "5",
  "77",
  {
    "key2": [
      "value3",
      "valueX",
      "valueY"
    ]
  },
  "j",
  "2"
]     

===================================================
a    
[
  "a",
  1,
  {
    "key1": "value1"
  },
  "5",
  "77",
  {
    "key2": [
      "value3",
      "valueX",
      "valueY"
    ]
  },
  "j",
  "2"
]     

===================================================
0
